backend/perf/load-test/results/2026-04-25_baseline/03a-sites-c1.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Finished 200 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3000

Document Path:          /api/sites
Document Length:        3948 bytes

Concurrency Level:      1
Time taken for tests:   2.120 seconds
Complete requests:      200
Failed requests:        0
Total transferred:      933644 bytes
HTML transferred:       789600 bytes
Requests per second:    94.35 [#/sec] (mean)
Time per request:       10.599 [ms] (mean)
Time per request:       10.599 [ms] (mean, across all concurrent requests)
Transfer rate:          430.11 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     7   10   3.4      9      27
Waiting:        7   10   3.4      9      27
Total:          7   11   3.4      9      27

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     10
  75%     12
  80%     13
  90%     16
  95%     17
  98%     19
  99%     26
 100%     27 (longest request)