backend/perf/load-test/results/2026-04-25_baseline/05-sites-c50.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3000

Document Path:          /api/sites
Document Length:        3948 bytes

Concurrency Level:      50
Time taken for tests:   4.626 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      2334230 bytes
HTML transferred:       1974000 bytes
Requests per second:    108.09 [#/sec] (mean)
Time per request:       462.558 [ms] (mean)
Time per request:       9.251 [ms] (mean, across all concurrent requests)
Transfer rate:          492.81 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       1
Processing:    15  445  71.1    463     590
Waiting:       14  445  71.1    463     589
Total:         15  446  70.9    463     590

Percentage of the requests served within a certain time (ms)
  50%    463
  66%    466
  75%    468
  80%    469
  90%    472
  95%    478
  98%    539
  99%    582
 100%    590 (longest request)